[BD_DefendBlockChain InteractiveObjectBalanceDefinition]
DefaultDisplayName="block and chain"

[InteractiveObjects.IO_BechoWafersPile InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_BlockChain_Ghost InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_BechoWaffers MissionItemDefinition]
UseFailureCharacterMessage="You should do it %s To use this function.."
ItemName="Beko Waffle Iron"
PickupMessage="by himself %s"
UseFailureLevelMessage="You must be at least %d level to use this feature.."
UseFailureConstraintsMessage="You can't use it."
NoManufacturerName="normal"

[ItemDefs.ID_BechoWaffers:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="It's worth it. In theory."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_BlockAndChain MissionItemDefinition]
UseFailureCharacterMessage="Nature. %s Take advantage of this opportunity."
ItemName="Block and chain"
PickupMessage="You agree %s"
UseFailureLevelMessage="You must have at least %d to use this item."
UseFailureConstraintsMessage="This item is not allowed.."
NoManufacturerName="Marshalling"

[ItemDefs.ID_BlockAndChain:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Personal block and chain..."
NoConstraintText=""
Suffix=""
Prefix=""

[M_Claptocurrency MissionDefinition]
MissionName="death of a thief"
MissionDescription="It has a meaning has a get-rich-quick idea with no morals. Although this operation is somewhat complex, it is simple. First, get the blocks to my Dahl.."
TurnInDescription="What an unexpected change!"
MissionSummary="Check out They were clapping's Get Rich Quick Blog."
MissionGiver="Claptrap"
MissionTurnInLocation="Claptrap"
TeaserText="Do you want to be very rich??"

[M_Claptocurrency:DeliverBechoWafers MissionObjectiveDefinition]
ProgressMessage="Bejo was signed"

[M_Claptocurrency:DestroyDarkweb MissionObjectiveDefinition]
ProgressMessage="Destroy the Dark Web"

[M_Claptocurrency:MineBECHO MissionObjectiveDefinition]
ProgressMessage="Mineral wafers BECHO"

[M_Claptocurrency:PlaceBlockChain MissionObjectiveDefinition]
ProgressMessage="Install the block and chain"

[M_Claptocurrency:PowerUpBlockChain MissionObjectiveDefinition]
ProgressMessage="Add Blockchain."

[M_Claptocurrency:Set_ActivateDrill MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Claptocurrency:Set_DeliverBechoWafers MissionObjectiveSetDefinition]
MissionSummaryOverride="Please donate a portion of your proceeds to Claptrap.."
MissionDescriptionOverride="Claptrap has the opportunity to become very rich, and for this he needs counterfeit money. He says take this money and give it to him.."

[M_Claptocurrency:Set_DestroyDarkWeb MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Claptocurrency:Set_MineBECHO MissionObjectiveSetDefinition]
MissionSummaryOverride="I am interested in my digital currency."
MissionDescriptionOverride="Claptrap has a get-rich-quick scheme. Now go to Dal Tunnel and ask what's left in my shop, it's BECHO Donuts. I either understand everything or I don't. Is it money but not money? Each currency is unique and similar to other currencies. The price is set, but isn't it? How unpleasant!..."

[M_Claptocurrency:Set_PlaceBlockChain MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Claptrap is an unethical get-rich-quick scheme! I don't know how I got rich here, but you brought the power of blockchain to Maine. Now it's time to move on to the second step of the plan: installing the circuit board.."

[M_Claptocurrency:Set_TakeBlocksChain MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Claptocurrency:Set_WatchThis MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="The cryptocurrency economy is over. Maybe he taught you humility."

[M_Claptocurrency:TakeBlockChain MissionObjectiveDefinition]
ProgressMessage="It uses blocks and chains."

[M_Claptocurrency:WatchThis MissionObjectiveDefinition]
ProgressMessage="see!"

